#Область СлужебныеПроцедурыИФункции
Процедура СформироватьСообщениеТелеграм(ТекстСообщения, РезультатОтправки) Экспорт

	ЧатID = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
		
	Ресурс = СтрШаблон("bot%1/sendMessage", Токен);
	
	Хост = "api.telegram.org";
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL();
	
	HTTPСоединение = Новый HTTPСоединение(Хост,,,,,,SSL);
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("chat_id", ЧатID);
	ДанныеОтвета.Вставить("text", ТекстСообщения);
		
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, ДанныеОтвета);
	ТелоЗапроса = Запись.Закрыть();
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);	
	
	
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка подключения");
		РезультатОтправки = Ложь;
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON();
	СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
	РезультатОтправки = Истина;
КонецПроцедуры


Процедура ОтправкаСообщенийВТелеграм() Экспорт
	РезультатОтправки = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка Как Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения Как ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления Как ПометкаУдаления
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	НЕ ВКМ_УведомленияТелеграмБоту.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СформироватьСообщениеТелеграм(Выборка.ТекстСообщения, РезультатОтправки);
		Если Не РезультатОтправки Тогда
			Продолжить;
		КонецЕсли;
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
	    СправочникОбъект.удалить();
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

