#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// БСП добавление  команты печати
//@skip-check doc-comment-parameter-section
Процедура ПроОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
		НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры

// БСП добавление  команты печати
//@skip-check doc-comment-parameter-section
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Заказ покупателя
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Заказ";
	КомандаПечати.Представление = НСтр("ru = 'Заказ покупателя'");
	КомандаПечати.Порядок = 5;
	
КонецПроцедуры

#КонецОбласти
 #КонецЕсли
