
#Область СлужебныеПроцедурыИФункции

Функция ВКМ_МассовоеСозданиеАбонентскихОтгрузок(ДатаНачала, ДатаОкончания) Экспорт
	
 Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
	|ПОМЕСТИТЬ ВТ_ДействующиеАбоненскиеДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &НачалоМесяца
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &КонецМесяца)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Договор.Ссылка
	|ПОМЕСТИТЬ ВТ_РеализацииАбоненские
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И
	|		РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|
	|	ВТ_ДействующиеАбоненскиеДоговора.Ссылка КАК Договор,
	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ЕСТЬNULL(ВТ_РеализацииАбоненские.Ссылка, ""Пусто"") КАК Реализация
	|ИЗ
	|	ВТ_ДействующиеАбоненскиеДоговора КАК ВТ_ДействующиеАбоненскиеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииАбоненские КАК ВТ_РеализацииАбоненские
	|		ПО ВТ_ДействующиеАбоненскиеДоговора.Ссылка = ВТ_РеализацииАбоненские.ДоговорСсылка";

Запрос.УстановитьПараметр("НачалоМесяца", ДатаНачала);
Запрос.УстановитьПараметр("КонецМесяца", ДатаОкончания);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();

  ДанныеДляОбработки = Новый ТаблицаЗначений();
  ДанныеДляОбработки.Колонки.Добавить("Договор");
  ДанныеДляОбработки.Колонки.Добавить("Реализация");
  
 // Проверить повторное создание реализаций.
  
  Пока Выборка.Следующий() Цикл
Если Выборка.Реализация = "Пусто" Тогда
	НовыйДокумент = ВКМ_СоздатьРеализацию(Выборка.Договор, ДатаОкончания);
КонецЕсли;
 
    НоваяСтрока = ДанныеДляОбработки.Добавить();
	НоваяСтрока.Договор = Выборка.Договор;
	НоваяСтрока.Реализация = ?(Выборка.Реализация = "Пусто", НовыйДокумент, Выборка.Реализация);
  
КонецЦикла;

Возврат ДанныеДляОбработки;

КонецФункции
	
Функция ВКМ_СоздатьРеализацию(Договор, ДатаОкончания) Экспорт
	
 НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
 НовыйДокумент.Договор = Договор;
 НовыйДокумент.Дата = ?(ДатаОкончания<> Неопределено, ДатаОкончания,ТекущаяДатаСеанса());
 НовыйДокумент.Контрагент = Договор.Владелец;
 НовыйДокумент.Организация = Договор.Организация;
 НовыйДокумент.ОбработкаЗаполнения(, , );
 НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение(НовыйДокумент);
 НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
 
 Возврат НовыйДокумент.Ссылка;
 
КонецФункции

Процедура ВКМ_ВыполнитьАвтозаполнение(Документ, Договор) Экспорт
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если НЕ ЗначениеЗаполнено(НоменклатураАбонентскаяПлата)ИЛИ НЕ ЗначениеЗаполнено(НоменклатураРаботыСпециалиста)
	Тогда ОбщегоНазначения.СообщитьПользователю("Не заполнена Номенклатура");
	Возврат;
	КонецЕсли;
	
	ТабУслуги = Документ.Услуги;
	ТабУслуги.Очистить();
	
	ВКМ_ДобавитьАбоненскуюПлату(НоменклатураАбонентскаяПлата, ТабУслуги,Договор);
	ВКМ_ДобавитьВыполненныеКлиентуРаботы(НоменклатураРаботыСпециалиста, ТабУслуги, Документ);

КонецПроцедуры

Процедура ВКМ_ДобавитьВыполненныеКлиентуРаботы(НоменклатураРаботыСпециалиста, ТабУслуги, Документ)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот Как СуммаКОплатеОборот,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоМесяца, &КонецМесяца, Месяц,) КАК
		|		ВКМ_ВыполненныеКлиентуРаботыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент = РеализацияТоваровУслуг.Контрагент
		|		И ВКМ_ВыполненныеКлиентуРаботыОбороты.Договора = РеализацияТоваровУслуг.Договор";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Документ.Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Документ.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	НоваяСтрока = ТабУслуги.Добавить();
	НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
	НоваяСтрока.Сумма = Выборка.СуммаКОплатеОборот;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВКМ_ДобавитьАбоненскуюПлату(НоменклатураАбонентскаяПлата, ТабУслуги, Договор)
		
АбонентскаяПлата= Договор.ПолучитьОбъект();
СуммаАбонентскойПлаты = АбонентскаяПлата.ВКМ_СуммаАбонентскойПлаты;
	Если СуммаАбонентскойПлаты = 0 Тогда
		Возврат;
	КонецЕсли;	
	
		НоваяСтрокаТЧ = ТабУслуги.Добавить();
	    НоваяСтрокаТЧ.Номенклатура = НоменклатураАбонентскаяПлата;
	    НоваяСтрокаТЧ.Сумма = СуммаАбонентскойПлаты;
  КонецПроцедуры
  
#КонецОбласти