#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// В начале месяца бухгалтер фирмы формирует акты по всем абонентским договорам
//@skip-check doc-comment-export-function-return-section
//@skip-check doc-comment-parameter-section
функция МассовоеСозданиеАбонентскихОтгрузок(ДатаНачала, ДатаОкончания) Экспорт
	
	 Запрос = Новый Запрос;
     Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы
	|ПОМЕСТИТЬ ВТ_ДействующиеАбоненскиеДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И (ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &НачалоМесяца
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &КонецМесяца)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Договор.Ссылка
	|ПОМЕСТИТЬ ВТ_РеализацииАбоненские
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И
	|		РеализацияТоваровУслуг.Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|
	|	ВТ_ДействующиеАбоненскиеДоговора.Ссылка КАК Договор,
	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ВТ_ДействующиеАбоненскиеДоговора.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ЕСТЬNULL(ВТ_РеализацииАбоненские.Ссылка, ""Пусто"") КАК Реализация
	|ИЗ
	|	ВТ_ДействующиеАбоненскиеДоговора КАК ВТ_ДействующиеАбоненскиеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииАбоненские КАК ВТ_РеализацииАбоненские
	|		ПО ВТ_ДействующиеАбоненскиеДоговора.Ссылка = ВТ_РеализацииАбоненские.ДоговорСсылка";

Запрос.УстановитьПараметр("НачалоМесяца", ДатаНачала);
Запрос.УстановитьПараметр("КонецМесяца", ДатаОкончания);

РезультатЗапроса = Запрос.Выполнить();

Выборка = РезультатЗапроса.Выбрать();
  
  Пока Выборка.Следующий() Цикл
Если Выборка.Реализация = "Пусто" Тогда
	ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СоздатьРеализацию(Выборка.Период, Выборка.Договор);
КонецЕсли;

КонецЦикла;
Возврат "";
КонецФункции

#КонецОбласти

#КонецЕсли	
