#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАкты(Команда)
	ДлительнаяОперация = ВыполнитьДлительнуюОперацию();	
	Оповещение = Новый ОписаниеОповещения("ФункцияВыполнена", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьДлительнуюОперацию()

ДатаНачала = Объект.Период.ДатаНачала;
ДатаОкончания = Объект.Период.ДатаОкончания;
ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	                    "ВКМ_РеализацияАгентскихДоговоровВызовСервера.ВКМ_СозданиеАбонентскихОтгрузок", ДатаНачала, ДатаОкончания);
             
Возврат ДлительнаяОперация;
КонецФункции

&НаКлиенте
Процедура ФункцияВыполнена(Результат, ДополнительныеПараметры) Экспорт
		Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выполнено");
ДанныеДокумента = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);				
УдалитьИзВременногоХранилища(Результат.АдресРезультата);
Таблица = Объект.ТабличнаяЧасть;
Таблица.Очистить();
Для Каждого Строка Из ДанныеДокумента Цикл
НоваяСтрока = Таблица.Добавить();
НоваяСтрока.Договор = Строка.Договор;
НоваяСтрока.Реализация = Строка.Реализация;	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


